#include<iostream>
using namespace std;

int a[1003][1003];//存放每棵树一开始的苹果数目，疏果数，重新计数的苹果数。
int b[1003];//存放每一行第1个数。
int c[1003];//存放每一棵苹果最后还有的苹果数。
int d[1003];//标记每一棵苹果树是否掉了果子。“1”表示掉了。

int main()
{
  int i,j,N,k,sum=0,len=0,le=0;
  cin>>N;//输入苹果总数。

  for(i=0;i<N;i++)
  {
    d[i]=0;//一开始将标记数组都设置为0.
    cin>>b[i];//表示后面还有几个整数。

    for(j=0;j<b[i];j++)
    {
       cin>>a[i][j];//输入后面疏果数，重新计苹果数。正数-重新计的苹果数；非正数-疏果数。
    }

  }

  for(i=0;i<N;i++)
  {
       c[i]=a[i][0];//每1棵苹果数一开始的数目。
     for(j=1;j<b[i];j++)
     {
       if(a[i][j]<=0)//为负数或0-表示疏果操作。
          c[i]=c[i]+a[i][j];
       else//正数-表示重新计数。
       {
         if(c[i]>a[i][j])//表示有苹果自己掉下来了
            d[i]=1;

          c[i]=a[i][j];//置为此时重新计数的苹果数。
       }
     }

  }

  for(i=0;i<N;i++)
  {
       sum=sum+c[i];
       if(d[i]==1)
        len=len+1;
  }

   for(i=0;i<N-2;i++)
   {
      if((i<N-2)&&(d[i]*d[i+1]*d[i+2]==1))
         le=le+1;
   }

   if((d[N-2]==1)&&(d[N-1])==1&&(d[0]==1))
         le=le+1;

   if((d[1]==1)&&(d[N-1])==1&&(d[0]==1))
         le=le+1;

   cout<<sum<<" "<<len<<" "<<le<<endl;
}
