#include<iostream>
using namespace std;

int getax(int a){//给定1个数，计算应该交的税。
   int tax=0,b;
   if(a>3500){//到达了税的起征点。
      b=a-3500;
      if(b<=1500)
          tax=b*0.03;
        else if((b>1500)&&(b<=4500))
            tax=1500*0.03+(b-1500)*0.1;
          else if((b>4500)&&(b<=9000))
              tax=1500*0.03+3000*0.1+(b-4500)*0.2;
            else if((b>9000)&&(b<=35000))
                tax=1500*0.03+3000*0.1+4500*0.2+(b-9000)*0.25;
              else if((b>35000)&&(b<=55000))
                  tax=1500*0.03+3000*0.1+4500*0.2+26000*0.25+(a-35000)*0.3;
                 else if((b>55000)&&(b<=80000))
                    tax=1500*0.03+3000*0.1+4500*0.2+26000*0.25+20000*0.3+(a-55000)*0.35;
                    else
                      tax=1500*0.03+3000*0.1+4500*0.2+26000*0.25+20000*0.3+25000*0.35+(b-80000)*0.45;
   }

   return tax;
}

int main(){

  int t,t1,t2,s;
    cin>>t;//输入税后工资

    if(t<10000){
       t1=t/100;
       s=t1*100;
    }
    else{
        t1=t/1000;
        s=t1*1000;
    }

    while(1){
        t2=getax(s);

        if((t2+t)==s)
            break;
        else
            s=s+100;

    }

    cout<<s<<endl;

  return 0;

}
